lib/webhook/__fixtures__/session-completed-realprod.json

{
  "event": "payment_session.completed",
  "created": "2026-04-26T09:23:19.140Z",
  "data": {
    "status": "COMPLETED",
    "amount": 800000,
    "currency": "IDR",
    "reference_id": "staging-tagihan-cmodtjyva1g7n7bx7lzpw5oht",
    "payment_session_id": "ps-69ec4131991c6b6d61d2e989",
    "payment_id": "py-baa5f75a-73b0-4d57-9476-58f1bb160168",
    "updated": "2026-04-26T09:23:18.882Z",
    "items": [
      {
        "name": "SPP April 2026",
        "quantity": 1,
        "price": 800000
      }
    ]
  },
  "customer": {
    "given_names": "Pak Budi",
    "email": "budi@example.com",
    "mobile_number": "+628123456789"
  },
  "billing_information": {
    "country": "ID",
    "street_line1": "Jl. Mawar No. 1"
  }
}
